// Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
// 4 -> 24 
// 5 -> 120

int Prod(int num)
{
    int result = 1;
    for (int i = 1; i <= num; i++)
    {
        result = result * i;
    }
    return result;
}

Console.Write("Введите чсло: ");
int N = Convert.ToInt32(Console.ReadLine());
int production = Prod(N);
Console.WriteLine(production);